#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.vpc: Refreshing state... [id=vpc-07f6c49d20d0aa9b1]
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:056212709895:cluster/app_cluster]
aws_ecs_task_definition.td: Refreshing state... [id=app]
aws_internet_gateway.gw: Refreshing state... [id=igw-09bcf2e3ff87d8014]
aws_subnet.sn3: Refreshing state... [id=subnet-03dd4526c50b597a9]
aws_subnet.sn1: Refreshing state... [id=subnet-082b958c5740adb29]
aws_subnet.sn2: Refreshing state... [id=subnet-034e7c1787d9dd05a]
aws_security_group.sg: Refreshing state... [id=sg-0a8e8e9f08c728703]
aws_route_table.rt: Refreshing state... [id=rtb-0ea4e5ae8c3d1817a]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:056212709895:service/app_cluster/app_service]
aws_route_table_association.route3: Refreshing state... [id=rtbassoc-04f319b0bbdb3ad65]
aws_route_table_association.route1: Refreshing state... [id=rtbassoc-0cd52d6ffacec214f]
aws_route_table_association.route2: Refreshing state... [id=rtbassoc-07fab8c0fc2389174]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:056212709895:cluster/app_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "app_service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:056212709895:task-definition/app:6"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0a8e8e9f08c728703",
            ]
          + subnets          = [
              + "subnet-034e7c1787d9dd05a",
              + "subnet-03dd4526c50b597a9",
              + "subnet-082b958c5740adb29",
            ]
        }
    }

  # aws_route_table_association.route1 will be created
  + resource "aws_route_table_association" "route1" {
      + id             = (known after apply)
      + route_table_id = "rtb-0ea4e5ae8c3d1817a"
      + subnet_id      = "subnet-082b958c5740adb29"
    }

  # aws_route_table_association.route2 will be created
  + resource "aws_route_table_association" "route2" {
      + id             = (known after apply)
      + route_table_id = "rtb-0ea4e5ae8c3d1817a"
      + subnet_id      = "subnet-034e7c1787d9dd05a"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vperezcerv, Action: `pull_request`*